## THIS NOTEBOOK WILL NOT WORK IN GOOGLE COLAB!!! IT MUST BE RUN LOCALLY!!! You can download it as an .ipynb file and open that with Jupyter notebook/labs

In [12]:
import sqlalchemy
import pymysql
from sqlalchemy import create_engine
import pandas as pd

In [13]:
password = 'iloveuva123!'
db_name = 'project_2'

In [14]:
conn = pymysql.connect(host='127.0.0.1', port=3306, user='root', password=password, database=db_name)

In [15]:
connection = create_engine("mysql+pymysql://root:" + password + "@localhost:3306/" + db_name)

In [22]:
file_name = 'database_draft.xlsx'

student_df = pd.read_excel(file_name, sheet_name = 'student_database')
subject_df = pd.read_excel(file_name, sheet_name = 'subject_database')
faculty_df = pd.read_excel(file_name, sheet_name = 'faculty_database')
house_df = pd.read_excel(file_name, sheet_name = 'house_database')

In [24]:
student_df.to_sql(name='students', con=connection, if_exists='replace', index=False)
subject_df.to_sql(name='subject', con=connection, if_exists='replace', index=False)
faculty_df.to_sql(name='faculty', con=connection, if_exists='replace', index=False)
house_df.to_sql(name='house', con=connection, if_exists='replace', index=False)

In [27]:
query1 = """

select house_name, count(house_name) as "Number of Students" 
from students 
join house on students.house_id = house.house_id 
group by house_name
order by count(house_name) desc
limit 3;

"""

query2 = """

select class_name, faculty_school
from subject
join faculty on subject.faculty_id = faculty.faculty_id;

"""


query3 = """

select class_name, concat(faculty_fname," ",faculty_lname) as 'taught by:', count(fav_class_id) as 'popular_class' #popular classes
from students
join subject on students.fav_class_id = subject.class_id
join faculty on faculty.subject_id = subject.class_name
group by class_name
order by popular_class desc
limit 3;

"""

In [28]:
result_df = pd.read_sql(query1, con=connection)
result_df

   house_name  Number of Students
0  gryffindor                  21
1   slytherin                   8
2   ravenclaw                   7

In [29]:
result_df2 = pd.read_sql(query2, con=connection)
result_df2

          class_name faculty_school
0            defense       hogwarts
1         arithmancy       hogwarts
2         herbology        hogwarts
3             flying       hogwarts
4   transfigurations       hogwarts
5            potions       hogwarts
6              lunch       hogwarts
7          quidditch       hogwarts
8         spellworks     durmstrang
9     rare_languages     durmstrang
10     culinary_arts    beauxbatons
11        literature    beauxbatons
12         etiquette    beauxbatons
13            charms       hogwarts

In [30]:
result_df3 = pd.read_sql(query3, con=connection)
result_df3

         class_name         taught by:  popular_class
0  transfigurations  auberon eisenberg             10
1           defense  auberon eisenberg              9
2             lunch  auberon eisenberg              7